Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: In addition, if there is nothing between a pair of delimiters within the input string, the corresponding substring will be empty.
ja: また、入力文字列の中で一対の区切り文字の間に何もない場合、対応する部分文字列は空となります。

source: In addition, many of AutoHotkey's enhancements to the AutoIt v2 command set, as well as the Window Spy and the old script compiler, were adapted directly from the AutoIt v3 source code.
ja: また、AutoIt v2コマンドセット、Window Spy、旧スクリプトコンパイラなど、AutoHotkeyの機能拡張の多くは、AutoIt v3のソースコードから直接採用されています。

source: In addition, mere aggregation of another work not based on the Program with the Program (or with a work based on the Program) on a volume of a storage or distribution medium does not bring the other work under the scope of this License.
ja: 加えて、『プログラム』に基づかない他の作品を、『プログラム』(あるいは『プ ログラム』に基づく作品)と共に一巻の記憶媒体や頒布媒体に集積しただけでは、そ の他の作品を本許諾書の適用範囲に含めることにはならない。

source: In addition, most apps keep these msg values the same even on different versions of themselves (e.g. Windows Media Player and Winamp).
ja: さらに、ほとんどのアプリは、バージョンが違ってもこれらのmsg値を同じに保つ（例：Windows Media PlayerとWinamp）。

source: In addition, performance is improved because the options are easier to parse.
ja: さらに、オプションの解析が容易になるため、パフォーマンスが向上する。

source: In addition, scripts perform better because they don't need to search for the target window again after it has been found the first time.
ja: さらに、スクリプトは、最初にターゲット・ウィンドウが見つかった後、再度検索する必要がないため、パフォーマンスが向上する。

source: In addition, since TrueOrFalse is an expression, true resolves to 1, and false to 0.
ja: さらに、TrueOrFalseは 式なので、trueは1に、falseは0に解決される。

source: In addition, some applications and games may have trouble tracking the mouse if it moves too quickly, in which case SetDefaultMouseSpeed can be used to reduce the speed (but only in SendEvent mode).
ja: また、アプリケーションやゲームによっては、マウスの動きが速すぎると追従できない場合があります。その場合は、SetDefaultMouseSpeedを使用して速度を下げることができます（ただし、SendEventモード時のみ）。

source: In addition, some applications and games may have trouble tracking the mouse if it moves too quickly.
ja: また、アプリケーションやゲームによっては、マウスの動きが速いと追従性が悪くなることがあります。

source: In addition, system responsiveness might be reduced during sound production.
ja: さらに、音を出す際にシステムの応答性が低下する可能性もあります。

source: In addition, the ColClick event is still raised, so the script can respond with a custom sort or other action.
ja: また、ColClickイベントは引き続き発生するので、スクリプトはカスタムソートなどのアクションで応答することができます。

source: In addition, the
ja: さらに、この

source: In addition, the /* and */ symbols can be used to comment out an entire section, as in this example:
ja: さらに、この/* および */記号は、この例のように、セクション全体をコメントアウトするために使用することができます：

source: In addition, the above action occurs at the time the key is released.
ja: また、鍵が離された時点で上記の動作が発生します。

source: In addition, the first hotkey above is replaced by the following, which prevents the keyboard's auto-repeat feature from generating repeated mouse clicks:
ja: さらに、上記の最初のホットキーは以下のように置き換えられ、キーボードのオートリピート機能によるマウスクリックの繰り返しを防ぎます：

source: In addition, the four characters "&<> are translated to &quot;&amp;&lt;&gt;.
ja: さらに、"&<>の4文字は&quot;&amp;&lt;&gt;に変換される。

source: In addition, the word Wind may be present in Options to use the winding method instead of the alternating method to determine the polygon's region.
ja: さらに、多角形の領域を決定するために、交互法の代わりに巻線法を使用するために、Optionsに単語Windが存在するかもしれない。

source: In addition, the word Wind maybe be present in Options to use the winding method instead of the alternating method to determine the polygon's region.
ja: さらに、多角形の領域を決定するために、交互法の代わりに巻線法を使用するために、Optionsに単語Windが存在するかもしれない。

source: In addition, they buffer any physical keyboard or mouse activity during the send, which prevents the user's keystrokes from being interspersed with those being sent.
ja: また、送信中にキーボードやマウスを操作した場合、バッファリングが行われるため、ユーザーのキー入力と送信中のキー入力が混在することを防ぐことができます。

source: In addition, they do not operate when the user is navigating through one of the script's menus (such as the tray icon menu or a menu bar).
ja: また、ユーザーがスクリプトのメニュー（トレイアイコンメニューやメニューバーなど）を操作しているときは、動作しません。

source: In addition, they will update the built-in hotkey variables such as A_ThisHotkey.
ja: また、A_ThisHotkeyなどの内蔵ホットキー変数も更新される予定です。

source: In addition, this function may have no effect due to the operating system's protection against applications that try to steal focus from the user (it may depend on factors such as what type of window is currently active and what the user is currently doing).
ja: さらに、この機能は、ユーザーからフォーカスを奪おうとするアプリケーションに対するオペレーティング・システムの保護のため、効果がない場合があります（現在アクティブになっているウィンドウの種類や、ユーザーが現在何をしているかなどの要因に依存する場合があります）。

source: In addition, this option reveals the newly selected item by expanding its parent(s), if necessary.
ja: さらに、このオプションは、必要に応じて、その親を展開することによって、新しく選択された項目を明らかにする。

source: In addition, use SysGet to discover the work area of a monitor, which can be smaller than the monitor's total area because the taskbar and other registered desktop toolbars are excluded.
ja: さらに、SysGet を使用して、タスク バーやその他の登録されたデスクトップ ツールバーが除外されるため、モニタの総面積よりも小さくなる可能性のあるモニタの作業領域を検出します。。

source: In addition, while it is running, it cannot be interrupted by any thread, including hotkeys, custom menu items, and timed subroutines.
ja: また、実行中は、ホットキー、カスタムメニュー項目、時間指定サブルーチンなど、いかなるスレッドによっても中断することができない。

source: In addition, you can press Ctrl+F1 (or another hotkey of your choice) to display that command's page in the help file.
ja: さらに、Ctrl+F1（またはお好みの他のホットキー）を押すと、ヘルプファイルにそのコマンドのページが表示されます。

source: In addition, you may still press Backspace to undo the most recently typed keystroke (even though you can't see the effect).
ja: さらに、Backspaceを押して、直近に入力したキー操作を取り消すこともできます（効果は確認できませんが）。

source: In addition, zero or more of the following options can be specified:
ja: さらに、以下のオプションを0個以上指定することができます：

source: In all cases, if the string will not be modified, the return value can be passed directly to a DllCall function or SendMessage.
ja: どのような場合でも、文字列が変更されない場合は、戻り値を直接 DllCall関数またはSendMessageに渡すことができます。

source: In all other cases, UTF-8 is used (this default differs from AutoHotkey v1).
ja: その他の場合はすべてUTF-8が使用されます（このデフォルトはAutoHotkey v1とは異なります）。

source: In all other cases, file patterns longer than 259 characters will not find any files or folders.
ja: それ以外の場合、259文字より長いファイルパターンは、ファイルやフォルダーを見つけることができません。

source: In all other cases, however, it is recommended to use at least one space or tab as a separation to improve readability.
ja: しかし、それ以外の場合は、読みやすさを向上させるために、少なくとも1つのスペースかタブを区切りとして使用することが推奨される。

source: In an expression where all operands resolve to True, the last operand that resolved to True is returned.
ja: すべてのオペランドがTrueに解決される式では、Trueに解決された最後のオペランドが返されます。

source: In an expression where at least one operand resolves to True, the first operand that resolved to True is returned.
ja: 少なくとも1 つのオペランドがTrueに解決される式では、Trueに解決された最初のオペランドが返されます。

source: In an expression, literal text must be enclosed in single or double quotation marks to differentiate it from a variable name or some other expression.
ja: 式中、リテラルテキストは、変数名や他の式と区別するために、シングルクォーテーションまたはダブルクォーテーションで囲む必要があります。

source: In an expression, the keywords true and false resolve to 1 and 0.
ja: 式では、キーワードtrueと falseは1と0に解決される。

source: In any case where detection fails, by default a menu is shown for the user to select a version.
ja: 検出に失敗した場合、デフォルトでは、ユーザーがバージョンを選択するためのメニューが表示されます。

source: In any case, a variable's memory can be freed later by assigning it to nothing, i.e. Text := "".
ja: いずれにせよ、Text := ""のように、変数に何も代入しないことで、変数のメモリを後で解放することができる。

source: In any case, the timer's previous Period and Priority are not retained.
ja: いずれの場合も、タイマーの以前のPeriodと Priorityは保持されない。

source: In any other case, a default message is used.
ja: それ以外の場合は、デフォルトのメッセージが使われる。

source: In any other case, the value is copied into a temporary VARIANT using the same rules as normal COM methods calls.
ja: それ以外の場合は、通常のCOMメソッド呼び出しと同じルールで、一時的なVARIANTに値がコピーされます。

source: In assume-static mode, any variable that should not be static must be declared as local or global (with the same exceptions as for assume-local mode).
ja: assume-staticモードでは、staticであってはならない変数は、ローカルまたはグローバルとして宣言しなければならない（assume-localモードと同じ例外あり）。

source: In both cases, one of the MatchList phrases must be typed in full.
ja: いずれの場合も、MatchListのフレーズのうち1つは全文入力する必要があります。

source: In both cases, the address of the original unmodified string is passed to the function.
ja: どちらの場合も、修正されていない元の文字列のアドレスが関数に渡されます。

source: In both cases, the function is defined unconditionally at the moment the script launches, but the function reference is stored in sumfn only if and when the assignment is evaluated.
ja: どちらの場合も、関数はスクリプトが起動した時点で無条件に定義されるが、関数参照がsumfnに格納されるのは、代入が評価されたときだけである。

source: In both cases, the spaces preceding the variable and dot are mandatory.
ja: いずれの場合も、変数とドットの前にあるスペースは必須です。

source: In both cases, the square brackets must be omitted unless parameters are defined.
ja: いずれの場合も、パラメータが定義されていない限り、角括弧は省略しなければならない。

source: In both of the below examples, the user's click of the mouse button will be sent to the active window:
ja: 以下の例では、いずれもユーザーがマウスボタンをクリックすると、アクティブウィンドウに送信されます：

source: In both v1 and v2, the sub-expressions are evaluated in left to right order.
ja: v1、v2ともに、部分式は左から右の順番で評価されます。

source: In directives (excluding #HotIf) and auto-replace hotstrings, quotation marks are not needed.
ja: ディレクティブ（#HotIfを除く）および自動置換ホットストリングでは、引用符は必要ありません。

source: In either case, any owned dialog or window is automatically destroyed when its GUI window is destroyed.
ja: いずれの場合も、所有するダイアログやウィンドウは、そのGUIウィンドウが破棄されると自動的に破棄されます。

source: In either case, ensure that the caller passes exactly this number of parameters.
ja: いずれの場合も、呼び出し元が正確にこの数のパラメータを渡すことを確認します。

source: In either case, how the remaining quote marks are interpreted depends entirely on the target program.
ja: いずれの場合も、残りの引用符がどのように解釈されるかは、ターゲットとなるプログラムに完全に依存します。

source: In fact, if the file is deleted immediately after use, it often does not actually get written to disk.
ja: 実際、使用後すぐにファイルを削除すると、実際にはディスクに書き込まれないことが多い。

source: In general, x.y(z) (method call) and x.y[z] (parameterized property) are two different operations, although they may be equivalent if x is a COM object (due to limitations of the COM interface).
ja: 一般に、x.y(z)（メソッドコール）とx.y[z]（パラメータ化されたプロパティ）は異なる操作ですが、xがCOMオブジェクトの場合は（COMインターフェースの制限により）同等である場合があります。

source: In general, Path can be any path.
ja: 一般に、パスは任意のパスにすることができます。

source: In general, an asterisk is used whenever a function has an argument type or return type that starts with "LP".
ja: 一般に、関数が「LP」で始まる引数型や戻り値を持つ場合、アスタリスクが使用されます。

source: In general, comma and expression operators can no longer be used for continuation in a textual context, such as with hotstrings or directives (other than #HotIf), or after an unclosed quoted string.
ja: 一般に、カンマや式演算子は、ホットストリングやディレクティブ（#HotIf以外）、閉じない引用文字列の後など、テキスト文脈での継続に使用できなくなりました。

source: In general, for a meta-function to be called for every property, one must avoid defining any properties.
ja: 一般的に、すべてのプロパティに対してメタファンクションを呼び出すには、プロパティを定義しないようにしなければなりません。

source: In general, if a script calls a function via DllCall which accepts a string as a parameter, one or more of the following approaches must be taken:
ja: 一般に、スクリプトがDllCallを介して、文字列をパラメータとして受け付ける関数を呼び出す場合、以下のアプローチのうちの1つ以上を取る必要があります：

source: In general, if more than one window matches, the topmost (most recently used) will be closed.
ja: 一般に、複数のウィンドウがマッチした場合、一番上の（最近使われた）ウィンドウが閉じられます。

source: In general, if more than one window matches, the topmost matching window (typically the one most recently used) will be activated.
ja: 一般的に、複数のウィンドウがマッチした場合、一番上のマッチしたウィンドウ（通常、最も最近使用されたウィンドウ）がアクティブになる。

source: In general, programs are affected by two kinds of path length limitations:
ja: 一般的に、プログラムは2種類のパス長制限の影響を受ける：

source: In general, v2 produces more consistent results with any code that depends on the type of a value.
ja: 一般的に、値の型に依存するようなコードでは、v2の方がより一貫した結果を得ることができます。

source: In icon view, moves the state image of the item to the top right of the large icon rendering.
ja: アイコン・ビューでは、アイテムの状態画像を大きなアイコン描画の右上に移動します。

source: In its most recognizable form, it displays a tabular view of rows and columns, the most common example of which is Explorer's list of files and folders (detail view).
ja: 最も分かりやすい形としては、行と列の表形式で表示され、最も一般的な例としては、エクスプローラーのファイルやフォルダのリスト（詳細表示）があります。

source: In its most recognizable form, the ListView control displays a tabular view of rows and columns.
ja: リストビューコントロールは、行と列の表形式を表示するものである。

source: In its two-parameter mode, this function is equivalent to IUnknown::QueryInterface.
ja: 2パラメータモードでは、この関数はIUnknown::QueryInterfaceと同等です。

source: In many cases (such as a message arriving via PostMessage), it does not matter which integer is returned; but if in doubt, 0 is usually safest.
ja: 多くの場合（PostMessageで届いたメッセージなど）、どの整数を返すかは問題ではありませんが、疑わしい場合は通常0が最も安全です。

source: In many cases it can also be done by simply running the script again, but that depends on the script's #SingleInstance setting.
ja: 多くの場合、スクリプトを再度実行するだけでも可能ですが、それはスクリプトの#SingleInstanceの設定によります。

source: In many cases, prefixing the path with \\?\ enables it to exceed the usual limit.
ja: 多くの場合、パスの前に\\?\を付けると、通常の制限を超えることができる。

source: In mode 1, the X and Y option letters of the Options parameter are ignored.
ja: モード1では、OptionsパラメータのXとYのオプション文字は無視されます。

source: In more general terms, a class is a set or category of things having some property or attribute in common.
ja: より一般的な言い方をすれば、クラスとは、何らかの特性や属性を共通に持つ物事の集合やカテゴリーのことである。

source: In most cases failure is because the target window or control was not found.
ja: 多くの場合、失敗の原因は対象となるウィンドウやコントロールが見つからなかったことにあります。

source: In most cases the version of the interpreter used will match the version of the base file selected by the user for the compile.
ja: ほとんどの場合、使用されるインタープリターのバージョンは、ユーザーがコンパイル用に選択したベースファイルのバージョンと一致する。

source: In most cases this is omitted.
ja: ほとんどの場合、これは省略されます。

source: In most cases this is omitted; if omitted, it defaults to "{00020400-0000-0000-C000-000000000046}" (IID_IDispatch).
ja: ほとんどの場合、これは省略されます。省略された場合、デフォルトは"{00020400-0000-C000-00000046}"（IID_IDispatch）です。

source: In most cases this will work even if lines end with CR+LF (`r`n), but the carriage return (`r) is included in comparisons and therefore affects the sort order.
ja: ほとんどの場合、行末がCR+LF（`r`n）であっても機能するが、キャリッジリターン（`r）は比較に含まれるため、ソートの順番に影響します。

source: In most cases, try on its own is meant to suppress an Error, so no change needs to be made.
ja: 多くの場合、try単体ではErrorを抑制するためのものなので、変更する必要はありません。

source: In most cases, Try on its own is meant to suppress an Error, so no change needs to be made.
ja: 多くの場合、Try単体ではErrorを抑制するためのものなので、変更する必要はありません。

source: In most cases, AutoHotkey automatically converts between numeric strings and pure numbers as needed, and rarely differentiates between the two types.
ja: ほとんどの場合、AutoHotkeyは必要に応じて数値文字列と純粋な数値の間を自動的に変換し、2つのタイプを区別することはほとんどありません。

source: In most cases, error dialogs now provide the option to continue the current thread (vs. exiting the thread).
ja: ほとんどの場合、エラーダイアログは、現在のスレッドを継続する（スレッドを終了する）オプションを提供するようになりました。

source: In most cases, passing a Buffer object is safer than passing an address, as the function can read the buffer size to ensure that it does not attempt to access any memory location outside of the buffer.
ja: ほとんどの場合、Bufferオブジェクトを渡す方がアドレスを渡すよりも安全です。なぜなら、関数はバッファサイズを読み取ることで、バッファの外側のメモリ位置にアクセスしようとしないことを確認できるからです。

source: In most common cases, return values from methods or properties of COM objects are converted to an appropriate data type supported by AutoHotkey.
ja: ほとんどの場合、COMオブジェクトのメソッドまたはプロパティからの戻り値は、AutoHotkeyがサポートする適切なデータ型に変換されます。

source: In object-oriented programming, a class is an extensible program-code-template for creating objects, providing initial values for state (member variables) and implementations of behavior (member functions or methods).
ja: オブジェクト指向プログラミングでは、クラスはオブジェクトを作成するための拡張可能なプログラム・コード・テンプレートであり、状態の初期値（メンバ変数）や動作の実装（メンバ関数またはメソッド）を提供する。

source: In order for non-ASCII characters to be read correctly from file, the encoding used when the file was saved (typically by the text editor) must match what AutoHotkey uses when it reads the file.
ja: ASCII以外の文字をファイルから正しく読み取るには、ファイルが保存されたときに使用されたエンコーディング（通常はテキストエディタ）と、AutoHotkeyがファイルを読み取るときに使用するエンコーディングが一致している必要があります。

source: In order for such characters to be interpreted correctly, your text editor and AutoHotkey must be on the same codepage, so to speak.
ja: このような文字を正しく解釈するためには、テキストエディタとAutoHotkeyが、いわば同じコードページにある必要があります。

source: In order of the system's automatic scaling to work, system functions such as MoveWindow and GetWindowRect automatically scale the coordinates that they accept or return.
ja: システムの自動スケーリングが機能するように、MoveWindowや GetWindowRectなどのシステム関数は、それらが受け取るか返す座標を自動的にスケーリングします。

source: In order to determine the correct index, locate the original interface definition.
ja: 正しいインデックスを決定するために、元のインターフェイスの定義を見つけてください。

source: In order to make SetKeyDelay effective, you must generally either use SendMode "Event" or call SendEvent, SendPlay or ControlSend instead of Send or SendText.
ja: SetKeyDelayを有効にするためには、一般的にSendMode "Event"を使用するか、SendやSendTextの代わりにSendEvent、SendPlay、ControlSendを呼ぶ必要があります。

source: In order to make them take effect, you must reload the script.
ja: それらを有効にするためには、スクリプトを再読み込みする必要があります。

source: In other cases, a TypeError may be thrown (and this should become the norm in future).
ja: それ以外の場合は、TypeErrorが投げられることがあります（将来的には、これが標準になるはずです）。

source: In other words, SetWorkingDir will not change the working directory that will be used for the new instance.
ja: 言い換えれば、SetWorkingDirは、新しいインスタンスに使用される作業ディレクトリを変更しません。

source: In other words, Run 'my.exe "A B"' is generally equivalent to Run 'my.exe A" "B'.
ja: つまり、Run 'my.exe "A B"'は一般的に Run 'my.exe A" "B' と同等です。

source: In other words, Send "a" produces the letter "a" while Send "{a}" may or may not produce "a", depending on the keyboard layout.
ja: つまり、Send "a"は「a」が出るが、Send "{a}"をと「a」が出るかどうかは、キーボードの配列によって異なります。

source: In other words, A ?? B behaves like A || B (logical-OR) except that the condition is IsSet(A).
ja: 言い換えれば、A ?? Bは、条件がIsSet(A)であることを除けば、A || B（論理和）のように振る舞う。

source: In other words, Hotkey A_ThisHotkey, "Off" turns off the current hotkey even if it is context-sensitive.
ja: つまり、Hotkey A_ThisHotkey, "Off "は、現在のホットキーがコンテキストセンシティブであってもオフします。

source: In other words, myObject := "" would cause the reference originally represented by address to be released.
ja: つまり、myObject := ""とすると、もともとaddressで表されていた参照が解放される。

source: In other words, Hidden and "Hidden" VarContainingOne are the same.
ja: つまり、Hiddenと "Hidden" VarContainingOneは同じです。

source: In other words, Disabled and "Disabled" VarContainingOne are the same.
ja: つまり、Disabledと "Disabled" VarContainingOneは同じです。

source: In other words, Beta is a name which has meaning to the object; it is not a local or global variable.
ja: つまり、Betaはオブジェクトに対して意味を持つ名前であり、ローカル変数やグローバル変数ではありません。

source: In other words, DownR has an effect similar to physically pressing the key.
ja: つまり、DownRは物理的にキーを押すのと同じような効果があるのです。

source: In other words, I want a certain key to act as it normally does except when a specific window is active.
ja: つまり、特定のウィンドウがアクティブなとき以外は、あるキーが通常通り動作するようにしたいのです。

source: In other words, StrGet is used to retrieve text from a memory address or buffer, or convert it to a format the script can understand.
ja: つまり、StrGetは、メモリアドレスやバッファからテキストを取得したり、スクリプトが理解できる形式に変換したりするために使用される。

source: In other words, a function call temporarily transfers control from the script to the function.
ja: つまり、関数呼び出しは、スクリプトから関数に一時的に制御を移します。

source: In other words, a declaration inside an IF's or ELSE's block takes effect unconditionally for the entire function (but any initializers included in the declaration are still conditional).
ja: つまり、IFのブロックやELSEのブロック内の宣言は、関数全体に対して無条件に効力を発揮します（ただし、宣言に含まれる初期化子は条件付きで残っています）。

source: In other words, a group consists of a set of criteria rather than a fixed list of windows.
ja: つまり、グループとは、ウィンドウの固定されたリストではなく、一連の基準で構成されているのです。

source: In other words, a line like local x := 0 has the same effect as writing two separate lines:
ja: つまり、local x := 0のような行は、2つの行を別々に書いたのと同じ効果がある。

source: In other words, a line like local x := 0 has the same effect as writing two separate lines: local x followed by x := 0.
ja: つまり、local x := 0のような行は、2つの行を別々に書いたのと同じ効果がある：local xに続いてx := 0。

source: In other words, a method call simply passes a message to the object, instructing it to do something.
ja: つまり、メソッドコールは、単にオブジェクトにメッセージを渡し、何かをするように指示するものです。

source: In other words, a sub-expression enclosed in parentheses, brackets or braces can automatically span multiple lines in most cases.
ja: 言い換えれば、括弧、ブラケット、ブレースで囲まれた部分式は、ほとんどの場合、自動的に複数行にまたがることができる。

source: In other words, all parameters that lie to the right of the first optional parameter must also be marked optional.
ja: つまり、最初のオプショナルパラメータの右側にあるすべてのパラメータもオプショナルと表示されなければならない。

source: In other words, any code following the function call does not execute until after the function completes.
ja: つまり、関数呼び出しに続くコードは、関数が完了するまで実行されない。

source: In other words, attempts to launch an already-running script are ignored.
ja: つまり、すでに実行されているスクリプトを起動しようとしても無視されます。

source: In other words, both "Check" and "Check" . VarContainingOne are the same (the period used here is the concatenation operator).
ja: つまり、"Check"も"Check" . VarContainingOneは同じである（ここで使われているピリオドは連結演算子である）。

source: In other words, both "Select" and "Select" . VarContainingOne are the same (the period used here is the concatenation operator).
ja: つまり、"Select"も"Select" . VarContainingOneは同じです（ここで使われているピリオドは連結演算子です）。

source: In other words, both "Expand" and "Expand" . VarContainingOne are the same.
ja: 言い換えれば、"Expand"も"Expand" . VarContainingOneは同じである。

source: In other words, calling myFunction(myVar) would pass the value of myVar to myFunction, not the variable itself.
ja: つまり、myFunction(myVar)を呼び出すと、myVarの値がmyFunctionに渡され、変数そのものは渡されません。

source: In other words, colons (when adjacent to another colon) must be escaped in the trigger text in v2, whereas in v1 they must be escaped in the replacement.
ja: つまり、コロン（他のコロンに隣接する場合）は、v2ではトリガーテキストでエスケープする必要がありますが、v1では置換でエスケープする必要があります。

source: In other words, copying a wildcard pattern such as "*.txt" is considered a success when it does not match any files.
ja: つまり、"*.txt"のようなワイルドカードパターンのコピーは、どのファイルにもマッチしない場合に成功したとみなされます。

source: In other words, do not specify two linefeeds in a row (`n`n) because that will result in a shorter-than-expected value being written to the registry.
ja: つまり、2つ並んだ改行（`n`n）を指定すると、予想以上に短い値がレジストリに書き込まれることになるので、指定しないようにしましょう。

source: In other words, each thread can be paused independently of the others.
ja: つまり、各スレッドは他のスレッドとは独立して一時停止することができるのです。

source: In other words, entire sections of hotstrings can have different default options as in this example:
ja: つまり、この例のように、ホットストリングのセクション全体が異なるデフォルトオプションを持つことができます：

source: In other words, if A is accessed or initialized first, the order is A1 to A3; otherwise it is B1 to B4:
ja: 言い換えれば、Aが最初にアクセスまたは初期化された場合、順番はA1からA3となり、そうでない場合はB1からB4となる：

source: In other words, if X1 is greater than X2, the search will be conducted from right to left, starting at column X1.
ja: つまり、X1が X2より大きい場合、X1列目から右から左へ検索を行うことになる。

source: In other words, if a line contains an unclosed (/[/{, it will be joined with subsequent lines until the number of opening and closing symbols balances out.
ja: つまり、ある行に閉じない(/[/{ が含まれている場合、開閉記号の数が釣り合うまで、後続の行と結合されます。

source: In other words, if an application restarts, all of its windows will get new ID numbers.
ja: 言い換えれば、アプリケーションを再起動すれば、ウィンドウには新しいIDを割り振られることになります。

source: In other words, if more than one hotstring matches something you type, only the one listed first in the script will take effect.
ja: つまり、入力した内容に複数のホットストリングがマッチした場合、スクリプトで最初にリストされたものだけが有効になります。

source: In other words, if the variable's capacity is already greater than RequestedCapacity, it will not be reduced (but the variable will still made blank for consistency).
ja: 言い換えれば、変数の容量がすでにRequestedCapacityより大きい場合、それは減少しない（しかし、一貫性のために変数はまだ空白にされる）。
